In [1]:
import os

In [2]:
os.getcwd()

'C:\\Users\\NIZAM'

In [3]:
import pandas as pd

In [5]:
pd.read_csv('datasheet2.csv')

       name    batch   roll no.  grade
0     manoj  python02        23     85
1    gorave  python02        25     88
2  prakash   python02        12     61
3     rahul  python03         2     78
4     karan  python06        44     87
5     kajal  python07        45     66
6      raju  python05        24     59

In [7]:
pd.read_excel('datasheet.xlsx')

       name    batch   roll no.  grade
0     manoj  python02        23     85
1    gorave  python02        25     88
2  prakash   python02        12     61
3     rahul   python3         2     78
4     karan  python06        44     87
5     kajal  python07        45     66

In [9]:
pd.read_csv('datasheet3.tsv',sep='\t')

      name     batch  roll no.  grade
0    manoj  python02        23     85
1   gorave  python02        25     88
2  prakash  python02        12     61
3    rahul  python03         2     78
4    karan  python06        44     87